"""7. Реализовать генератор с помощью функции с ключевым словом yield, создающим очередное значение.
При вызове функции должен создаваться объект-генератор. Функция должна вызываться следующим образом: for el in fact(n).
Функция отвечает за получение факториала числа, а в цикле необходимо выводить только первые n чисел, начиная
с 1! и до n!.
Подсказка: факториал числа n — произведение чисел от 1 до n. Например, факториал четырёх 4! = 1 * 2 * 3 * 4 = 24.
"""
from task_func import custom_range, custom_cycle, custom_reduce


def factorial(n):
    fact = 1
    for num in custom_range(2, n):
        print(num)
        fact *= num
    yield fact


for el in factorial(4):
    print(el)